ParaTu722/stm32_learn_progress/结课小项目/微型潜艇究极版/Hardware/ad.c
#include "stm32f10x.h"


//光敏：PA3，通道3
//雨滴：PA7，通道7
void AD_Init(void)
{
	//1.使能gpio，adc1时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
	
	RCC_ADCCLKConfig(RCC_PCLK2_Div6);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
	GPIO_InitStructure.GPIO_Pin	= GPIO_Pin_7 | GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	ADC_InitTypeDef ADC_InitStructure;
	
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
	ADC_InitStructure.ADC_ScanConvMode = DISABLE;
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
	ADC_InitStructure.ADC_NbrOfChannel = 1;
	
	
	
	ADC_Init(ADC1, &ADC_InitStructure);
	ADC_Cmd(ADC1,ENABLE); //使能或者失能指定的 ADC
	
	ADC_ResetCalibration(ADC1);	//重置指定的 ADC 的校准寄存器
	while(ADC_GetResetCalibrationStatus(ADC1) == SET);	//获取 ADC 重置校准寄存器的状态
	ADC_StartCalibration(ADC1);	//开始指定 ADC 的校准程序
	while(ADC_GetCalibrationStatus(ADC1) == SET);//	获取指定 ADC 的校准状态
	
	
}
uint16_t Get_ADValue(uint8_t ADC_Channel)
{
	//设置指定 ADC 的规则组通道，设置它们的转化顺序和采样时间
	ADC_RegularChannelConfig(ADC1, ADC_Channel, 1, ADC_SampleTime_55Cycles5);
	
	ADC_SoftwareStartConvCmd(ADC1,ENABLE);	//使能或者失能指定的 ADC 的软件转换启动功能
	
	while(ADC_GetFlagStatus(ADC1,ADC_FLAG_EOC) == RESET);	//检查制定 ADC 标志位置 1 与否
	
	return ADC_GetConversionValue(ADC1);	//返回最近一次 ADCx 规则组的转换结果
}

